# NewCategorySet Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewCategorySet Method
Application Class See Also
---
Creates a new instance of a set specifically for holding category objects.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public CategorySet NewCategorySet()
```

Visual Basic
---
```text
Public Function NewCategorySet As CategorySet
```

Visual C++
---
```text
public:
CategorySet^ NewCategorySet()
```

# ### Return Value
A new instance of a Category Set.
# Remarks
This type of set is used during the creation of instance and type bindings.
# See Also
Application Class
Autodesk.Revit.Creation Namespace